# task 01 == Виправте синтаксичні помилки
print("Hello", end = " ")
print("world!") ## були зайві відступи на початку строки

# task 02 == Виправте синтаксичні помилки
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!") ## на початку не вистачало відступу

# task 03  == Вcтавте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print(letter) ## додав змінну letter у print(letter), щоб друкувати кожну літеру.

# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
banana = apples * 4 ##зробив залежність від яблук: banana = apples * 4.

# task 05 == виправте назви змінних
storona_1 = 1 ## не можна, бо назва змінної не може починатися з цифри.
storona_2 = 2
storona_3 = 3
storona_4 = 4 ##2-4 містили заборонені символи ? та $.

# task 06 == Порахуйте периметр фігури з task 05
# та виведіть його для користувача

perimeter = storona_1 + storona_2 + storona_3 + storona_4
print("Периметр фігури =", perimeter)


"""
    # Задачі 07 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""

# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?

"""
yabluni =4
grushi = yabluni + 5
slivi = yabluni - 2
trees = grushi + slivi
print("Всьог дерев у саду:", trees)

# task 08
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""
temp_morning = 5
temp_afternoon = temp_morning - 10
temp_evening = temp_afternoon + 4
print("Температура під вечерочок:", temp_evening, "градусів")

# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""
boys = 24
girls = boys // 2
today = (boys - 1) + (girls - 2)
print("Сьогодні у гуртку залишилось:", today)

# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""

book_1 = 8
book_2 = book_1 + 2
book_3 = (book_1 + book_2) / 2
total_price = book_1 + book_2 + book_3
print("Усі книги коштують", total_price, "грн")
